package by.softclub.util.text;

/**
 * Created by gid on 07.04.14.
 */
abstract class WritableSummBe extends AbstractWritableSumm {
    {
        str1 = new String[][] {
                {"нуль", "адзін", "два", "тры", "чатыры", "пяць", "шэсць", "сем", "восем", "дзевяць"},
                {"нуль", "адна", "дзве", "тры", "чатыры", "пяць", "шэсць", "сем", "восем", "дзевяць"},
        };
        str100 = new String[]{"", "сто", "дзвесце", "трыста", "чатырыста", "пяцьсот",
                    "шэсцьсот", "семсот", "восемсот", "дзевяцьсот"};
        str11 = new String[]{"", "адзінаццаць", "дванаццаць", "трынаццаць", "чатырнаццаць",
                "пятнаццаць", "шаснаццаць", "семнаццаць", "васемнаццаць", "дзевятнаццаць","дваццаць"};
        str10 = new String[]{"", "дзесяць", "дваццаць", "трыццаць", "сорак", "пяцьдзесят",
                "шэсцьдзесят", "семдзесят", "восемдзесят", "дзевяноста"};
    }
    final String[][] forms = {
                {"", "", "", "0"},
                {"", "", "", "0"},
                {"тысяча", "тысячы", "тысяч", "1"},
                {"мільён", "мільёны", "мільёнаў", "0"},
                {"мільярд", "мільярда", "мільярдаў", "0"},
                {"трыльён", "трыльёна", "трыльёнаў", "0"},
    };
    protected int getUnitGender(int idx) {
        return new Integer(forms[idx][3]);
    }
    protected String getUnit(int idx, long cnt) {
        if (cnt % 100 > 4 && cnt % 100 < 21)
            return forms[idx][2];
        switch ((int)(cnt % 10)) {
            case 1:
                return forms[idx][0];
            case 2:
            case 3:
            case 4:
                return forms[idx][1];
            default:
                return forms[idx][2];
        }
    }    // получение единиц, 11-19, десятков, сотен
}