package by.softclub.util.text;

/**
 * Created by gid on 07.04.14.
 */
abstract class WritableSummRu extends AbstractWritableSumm {
    {
        str1 = new String[][]{
                {"ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"},
                {"ноль", "одна", "две", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"},
        };

        str100 = new String[]{"", "сто", "двести", "триста", "четыреста", "пятьсот",
                "шестьсот", "семьсот", "восемьсот", "девятьсот"};
        str11 = new String[]{"", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
                "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать",
                "двадцать"};
        str10 = new String[]{"", "десять", "двадцать", "тридцать", "сорок", "пятьдесят",
                "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    }

    final String[][] forms = {
            {"", "", "", "0"},
            {"", "", "", "0"},
            {"тысяча", "тысячи", "тысяч", "1"},
            {"миллион", "миллиона", "миллионов", "0"},
            {"миллиард", "миллиарда", "миллиардов", "0"},
            {"триллион", "триллиона", "триллионов", "0"},
    };

    protected int getUnitGender(int idx) {
        return new Integer(forms[idx][3]);
    }

    protected String getUnit(int idx, long cnt) {
        if (cnt % 100 > 4 && cnt % 100 < 21)
            return forms[idx][2];
        switch ((int) (cnt % 10)) {
            case 1:
                return forms[idx][0];
            case 2:
            case 3:
            case 4:
                return forms[idx][1];
            default:
                return forms[idx][2];
        }
    }    // получение единиц, 11-19, десятков, сотен
}